{
  "advertiser_id": "ID of Advertiser object associated to offer (if any)",
  "allow_direct_links": "'Direct Links' setting in Offer Tracking Settings See also: Direct Links",
  "allow_multiple_conversions": "'Multiple Conversions' setting in Offer Tracking Settings.",
  "allow_website_links": "'Deep Links' setting in Offer Tracking Settings See also: Deep Links",
  "approve_conversions": "Approve Conversions setting in Offer Tracking Settings. A null value is treated as false.",
  "click_macro_url": "'Click Macro URL' setting in Offer Tracking Settings. Applicable if disable_click_macro is set to false.",
  "conversion_cap": "'Daily Conversions' cap setting in Offer Settings. A value of 0 means there is no general daily conversion cap for offer. See: Conversion Caps",
  "conversion_ratio_threshold": "This parameter has been deprecated. [Deprecated]",
  "converted_offer_id": "ID of Offer object for 'Secondary Offer' setting in Offer Tracking Settings. Applicable only if converted_offer_type is set to 'network'.",
  "converted_offer_type": "Core 'Secondary Offer' setting in Offer Tracking Settings. Applicable if 'Redirect Offers' network-wide offer setting is enabled and 'SEO Friendly Links' network-wide offer setting is disabled.",
  "converted_offer_url": "Custom URL value for 'Secondary Offer' setting in Offer Tracking Settings. Applicable only if converted_offer_type is set to 'url'.",
  "create_date_utc": "Date the offer was created",
  "currency": "'Offer Currency' value in Offer Payout Settings, corresponding to three-character code as listed in Using Multiple Currencies. If set to null, offer uses 'Currency' network-wide application setting. Returns error if attempting to set field to any other code. Available only if 'Multiple Currencies' network-wide application setting is enabled.",
  "customer_list_id": "ID of CustomerList object associated with offer (if any) See also: Customer Lists",
  "default_goal_name": "Name of default goal (Goal.name). Applicable only if has_goals_enabled is set to true.",
  "default_payout": "Flat payout amount for offer. Applicable only if payout_type is or includes a flat-amount type: 'cpa_flat', 'cpa_both', 'cpc', or 'cpm'.",
  "description": "Offer's description text/HTML",
  "disable_click_macro": "'Click Macro' setting in Offer Tracking Settings. Is true if setting is set to 'Disabled', false if set to 'Enabled'. Applicable if 'Global Click Macro' network-wide tracking setting is enabled.",
  "display_advertiser": "'Display Advertiser' setting in Offer Settings Applicable if 'Display Advertiser' network-wide offer setting is enabled.",
  "dne_download_url": "Contents of Download URL entry in suppression list associated to offer, as referred to in dne_list_id (if any). Cannot write to this field. Use DneList controller to manipulate related DneList object.",
  "dne_list_id": "ID of DneList object associated to offer (if any). Applicable only if show_mail_list is set to true. See also: Suppression Lists",
  "dne_third_party_list": "Flag indicating if the offer uses a third-party DNE list. See also: DneList controller, DneList model",
  "dne_unsubscribe_url": "'Contents of Unsubscrube URL' entry in suppression list associated to offer, as referred to in dne_list_id (if any).Cannot write to this field. Use DneList controller to manipulate related DneList object.",
  "email_instructions": "'Email Instructions' setting in Offer Settings. Must be set to true for related fields to apply.See also: Suppression Lists",
  "email_instructions_from": "'Contents of Approved From Lines' entry in offer's Suppression Lists settings. Use line breaks to separate multiple entries. Applicable if the 'email_instructions' field is set to true.",
  "email_instructions_subject": "'Contents of Approved Subject Lines' entry in offer's Suppression Lists settings. Use line breaks to separate multiple entries. Applicable if the 'email_instructions' field is set to true.",
  "enable_offer_whitelist": "'Offer Whitelist' setting in Offer Tracking Settings See also: Offer Whitelist",
  "enforce_encrypt_tracking_pixels": "'Encrypted Conversion Tracking' setting in Offer Tracking Settings. Applicable if 'Encrypt Conversion URLs' network-wide tracking setting is enabled.",
  "enforce_geo_targeting": "'Enforce Geo-Targeting' setting in Offer Targeting. Must be set to true for related fields to apply.See: Geo-Targeting",
  "enforce_secure_tracking_link": "Enforce SSL by generating all affiliate tracking links and impression pixels with https instead of http",
  "expiration_date": "Offer's expiration date",
  "featured": "Date offer was selected as a featured offer (available at the network Snapshot page). If this is set to null or '0000-00-00 00:00:00', offer is not selected as a featured offer.",
  "has_goals_enabled": "'Multiple Conversion Goals' setting in Offer Payout. Must be set to true for related fields to apply.See: Offer Goals",
  "hostname_id": "ID of Hostname object associated to offer (if any), for use with custom tracking domains.",
  "id": "This object's ID, automatically generated upon creation.",
  "is_expired": "Flag indicating if offer has expired—if the current date is past the value in expiration_date",
  "is_private": "'Private' setting in Offer SettingsSee also: Affiliate Access to Offers",
  "is_seo_friendly_301": "'SEO-Friendly Links' setting in Offer Settings Applicable if 'SEO-Friendly Links' network-wide offer setting is enabled.See also: Tiny URLs & SEO-Friendly Links",
  "is_subscription": "'Subscription' setting in Offer Tracking SettingsSee also: Subscriptions",
  "lifetime_conversion_cap": "'Lifetime Conversions' cap setting in Offer Settings. A value of 0 means there is no general lifetime conversion cap for offer.See: Conversion Caps",
  "lifetime_payout_cap": "'Lifetime Payout' cap setting in Offer Settings. A value of 0 means there is no general lifetime payout cap for offer.See: Conversion Caps",
  "lifetime_revenue_cap": "'Lifetime Reveune' cap setting in Offer Settings. A value of 0 means there is no general lifetime payout cap for offer.See: Conversion Caps",
  "max_payout": "Flat revenue amount for offer. Applicable only if revenue_type is or includes a flat-amount type: 'cpa_flat', 'cpa_both', 'cpc', or 'cpm'.Note: Parameter name is a holdover. This does refer to offer's revenue values.",
  "max_percent_payout": "Percentage of sale revenue for offer. Applicable only if revenue_type is or includes a percentage type: 'cpa_percentage' or 'cpa_both'.Note: Parameter name is a holdover. This does refer to offer's revenue values.",
  "modified": "Timestamp of most recent change to object",
  "monthly_conversion_cap": "'Monthly Conversions' cap setting in Offer Settings. A value of 0 means there is no general monthly conversion cap for offer.See: Conversion Caps",
  "monthly_payout_cap": "'Monthly Payout' cap setting in Offer Settings. A value of 0 means there is no general monthly payout cap for offer.See: Conversion Caps",
  "monthly_revenue_cap": "'Monthly Revenue' cap setting in Offer Settings. A value of 0 means there is no general monthly revenue cap for offer.See: Conversion Caps",
  "name": "Offer's display name",
  "note": "'Notes' field in Offer Settings.This parameter is exposed to advertiser and network users only, not to affiliate users.",
  "offer_url": "Default offer URL/landing page offer redirects traffic to.See Passing Values to Offer URLs for details on optional variables and macros.",
  "payout_cap": "'Daily Payout' cap setting in Offer Settings. A value of 0 means there is no general daily payout cap for offer.See: Conversion Caps",
  "payout_type": "Offer's payout type, as described in Offer Payouts.Values of 'cpa_flat', 'cpm', and 'cpc' indicate a flat payout amount, which is specified in the default_payout field.Value of 'cpa_percentage' indicates payout is a percentage of sale, which is specified in the percent_payout field.Value of 'cpa_both' indicates both a flat payout amount and a percentage of sale payout.",
  "percent_payout": "Percentage of sale payout for offer. Applicable only if payout_type is or includes a percentage type: 'cpa_percentage' or 'cpa_both'.",
  "preview_url": "URL used to preview page offer redirects to.",
  "protocol": "Conversion tracking protocol to use for offer.See: Conversion Tracking Essentials",
  "rating": "Offer's rating as displayed to affiliate and network users, ranked from 1 to 5. This field is active if the network has the Offer Ratings setting enabled.See: Network-Wide Offer Settings",
  "redirect_offer_id": "ID of Offer object for 'Redirect Offer' setting in Offer Tracking Settings.",
  "ref_id": "'Reference ID' setting in Offer Details",
  "require_approval": "'Require Approval' setting in Offer Settings",
  "require_terms_and_conditions": "'Terms and Conditions' setting in Offer SettingsIf set to 'enabled,' terms_and_conditions parameter should contain data.Important: Use 'enabled' and 'disabled' for all inputs, including for data objects and filter options. However, values the API returns are '0' for disabled and '1' for enabled.",
  "revenue_cap": "'Daily Revenue' cap setting in Offer Settings. A value of 0 means there is no general daily revenue cap for offer.See: Conversion Caps",
  "revenue_type": "Offer's revenue type, as described in Offer Payouts.Values of 'cpa_flat', 'cpm', and 'cpc' indicate a flat revenue amount, which is specified in the max_payout field.Value of 'cpa_percentage' indicates revenue is a percentage of sale, which is specified in the max_percent_payout field.Value of 'cpa_both' indicates both a flat revenue amount and a percentage of sale revenue.Note: Values are same as in payout_type for unity, rather than using 'rpa_flat' etc.",
  "session_hours": "'Click Session Lifespan' setting in Offer Tracking Settings, in hours.",
  "session_impression_hours": "'Impression Session Lifespan' setting in Offer Tracking Settings, in hours. Applicable only if set_session_on_impression is set to true.",
  "set_session_on_impression": "'Start Session Tracking' setting in Offer Tracking Settings; true is selection is for impressions, false if for clicks. Applicable only if protocol is set to a pixel-based value, otherwise defaults to false.See: Impression Tracking",
  "show_custom_variables": "'Custom Variables' setting in Offer Tracking Settings.See: Custom Variables",
  "show_mail_list": "'Suppression List' setting in Offer Settings.See: Suppression Lists",
  "status": "Offer's statusSee: Offer Overview",
  "subscription_duration": "'Subscription Duration' setting in Offer Tracking Settings, in seconds. A value of 0 means the duration is indefinite.Applicable only if is_subscription is set to true.",
  "subscription_frequency": "'Subscription Frequency' setting in Offer Tracking Settings.Applicable only if is_subscription is set to true.",
  "target_browsers": "This parameter has been deprecated.[Deprecated]",
  "terms_and_conditions": "Offer's terms and conditions text/HTML as shown in Offer Settings. Should contain non-empty value if require_terms_and_conditions is true.",
  "tiered_payout": "Relates to 'Payout Method' setting in Offer Payout Settings. Is true if setting is set to 'Tiered', false otherwise. Cannot be set to true if use_payout_groups is also true.See: Payout & Revenue Tiers",
  "tiered_revenue": "Relates to 'Revenue Method' setting in Offer Payout Settings. Is true if setting is set to 'Tiered', false otherwise. Cannot be set to true if use_revenue_groups is also true.See: Payout & Revenue Tiers",
  "use_payout_groups": "Relates to 'Payout Method' setting in Offer Payout Settings. Is true if setting is set to 'Groups', false otherwise. Cannot be set to true if tiered_payout is also true.See: Payout & Revenue Groups",
  "use_revenue_groups": "Relates to 'Revenue Method' setting in Offer Payout Settings. Is true if setting is set to 'Groups', false otherwise. Cannot be set to true if tiered_revenue is also true.See: Payout & Revenue Groups",
  "use_target_rules": "'Advanced Targeting' setting in Offer Targeting. Set to true if 'Show the offer to targeted devices' is selected.See: Advanced Targeting",
  "website_links_copy_static_params": "'Copy Static Parameters to Deep Links' setting in Offer Tracking Settings. Applicable only if allow_website_links is true.See also: Deep Links"
}
